DataProcessors/ПодборДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ПодборДО</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаПодбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодборДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточника</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтроки</Name>
					<Comment>Последний номер строки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодбораОбъектов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодбораОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСправочника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСправочникаДляПодбора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>16</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/НазначениеНастроекОтбора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>НазначениеНастроекОтбора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодборДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РабочийСтолДО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСправочникаДляПодбора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыСправочникаДляПодбора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолговыеОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СудебныеДела</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныеПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектыВРаботе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПодбораОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыПодбораОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолнаяВыгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоОбъектыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоОбъектыНеВРаботе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиПодборДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>НастройкиПодборДО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтроки</Name>
					<Comment>Последний номер строки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеНастроекОтбора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодбораОбъектов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодбораОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСправочника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСправочникаДляПодбора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>32</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>16</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПодборДО/Forms/ФормаДинамическийСписок/Ext/Form/Module.bsl
&НаКлиенте
Процедура Отобрать(Команда)
	ОтобратьПоДинамическомуСписку();
	УстановитьФлажки(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ОтобратьПоДинамическомуСписку()
	Схема     = Элементы.СписокДО.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.СписокДО.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Объект.Объекты.Загрузить(ТаблицаРезультат);
КонецПроцедуры

&НаСервере
Процедура ОтобратьПоДинамическомуСпискуСУчетомВыделения()
	Схема     = Элементы.СписокДО.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.СписокДО.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	Если Элементы.СписокДО.ВыделенныеСтроки.Количество() > 0 Тогда
		 Отбор = Настройки.Отбор.Элементы;
		 ЭлементОтбора = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
		 ЭлементОтбора.ПравоеЗначение = Список;
		 ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Объект.Объекты.Загрузить(ТаблицаРезультат);
КонецПроцедуры


&НаКлиенте
Процедура Добавить(Команда)
	ПомеченныеСтроки = Объект.Объекты.НайтиСтроки(Новый Структура("Пометка", Истина));
		
	Если ПомеченныеСтроки.Количество() = 0 Тогда
		Сообщить("Ничего не отмечено!");
	Иначе			
		Для Каждого Элемент Из ПомеченныеСтроки Цикл
			Нов = ВладелецФормы.Объект.Объекты.Добавить();
			Нов.Объект = Элемент.Объект;	
			Попытка
				Нов.Контрагент = Элемент.Объект;
				Нов.ДоговорКонтрагента = Элемент.Объект;	
				Нов.УслугаПоДоговору = Элемент.Объект;
				Нов.ДолговоеОбязательство = Элемент.Объект;
				Нов.ИсполнительныйДокумент = Элемент.Объект;
			Исключение
			КонецПопытки;
		КонецЦикла;
		ЭтаФорма.Закрыть();
	КонецЕсли;  	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	Если Объект.НастройкаПодбор <> ПредопределенноеЗначение("Справочник.НастройкиПодборДО.ПустаяСсылка") Тогда
		ЗаписатьНастройку();		
	Иначе
		Форма = ПолучитьФорму("Справочник.НастройкиПодборДО.Форма.ФормаЭлемента", Новый Структура("Настройка", НастройкиПодбора()), 
		ЭтаФорма);
		
		Форма.Объект.НомерСтроки = Объект.НомерСтроки;
		Форма.Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначениеНастроекОтбора.ПодборДО");
		Форма.Объект.ВидПодбораОбъектов = Объект.ВидПодбораОбъектов;
		Форма.Объект.ВидСправочника = Объект.ВидСправочника;
		
		Форма.ОткрытьМодально();	
		Если Не Форма.Объект.Ссылка.Пустая() Тогда
			Объект.НастройкаПодбор = Форма.Объект.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройку()
	СпрОбъект = Объект.НастройкаПодбор.ПолучитьОбъект();
	СпрОбъект.ВидСправочника = Объект.ВидСправочника;
	СпрОбъект.ВидПодбораОбъектов = Объект.ВидПодбораОбъектов;
	СпрОбъект.Настройка = Новый ХранилищеЗначения(НастройкиПодбора());
	СпрОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодборПриИзменении(Элемент)    
	Если ЗначениеЗаполнено(Объект.НастройкаПодбор) Тогда
		Если Объект.ВидПодбораОбъектов <> ОбъектыСервер.РазыменоватьСсылку(Объект.НастройкаПодбор, "ВидПодбораОбъектов") ИЛИ Объект.ВидСправочника <> ОбъектыСервер.РазыменоватьСсылку(Объект.НастройкаПодбор, "ВидСправочника") Тогда
			Объект.ВидПодбораОбъектов = ОбъектыСервер.РазыменоватьСсылку(Объект.НастройкаПодбор, "ВидПодбораОбъектов");
			Объект.ВидСправочника = ОбъектыСервер.РазыменоватьСсылку(Объект.НастройкаПодбор, "ВидСправочника");
			ПерезаполнитьЗапрос();
		КонецЕсли;
		Массив = ОбъектыСервер.РазыменоватьСсылку(Объект.НастройкаПодбор, "Настройка.Получить()");
		СписокДО.КомпоновщикНастроек.ЗагрузитьНастройки(Массив[0]);
		УстановитьЗначенияПараметров();
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Элемент Из Объект.Объекты Цикл
		Элемент.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Элемент Из Объект.Объекты Цикл
		Элемент.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастрйкиКак(Команда)
	Форма = ПолучитьФорму("Справочник.НастройкиПодборДО.Форма.ФормаЭлемента", Новый Структура("Настройка", НастройкиПодбора()), 
	ЭтаФорма);
	
	Форма.Объект.НомерСтроки = Объект.НомерСтроки;
	Форма.Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначениеНастроекОтбора.ПодборДО");
	Форма.Объект.ВидПодбораОбъектов = Объект.ВидПодбораОбъектов;
	Форма.Объект.ВидСправочника = Объект.ВидСправочника;
	
	Форма.ОткрытьМодально();	
	Если Не Форма.Объект.Ссылка.Пустая() Тогда
		Объект.НастройкаПодбор = Форма.Объект.Ссылка;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НастройкиПодбора()
	Массив = Новый Массив();
	Настройки = Элементы.СписокДО.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	Массив.Добавить(Настройки);
	Схема = Элементы.СписокДО.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Массив.Добавить(Схема);
	Возврат Массив;	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ВладелецФормы = Неопределено Тогда
		Элементы.Добавить.Видимость = Ложь;
		Объект.ВидСправочника = ПредопределенноеЗначение("Перечисление.ВидыСправочникаДляПодбора.ДолговыеОбязательства");
		Объект.ВидПодбораОбъектов = ПредопределенноеЗначение("Перечисление.ВидыПодбораОбъектов.ТолькоОбъектыВРаботе");
	КонецЕсли;
	ПерезаполнитьЗапрос();
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПараметров()
	//СписокДО.Параметры.УстановитьЗначениеПараметра("Организация", ПараметрыСеанса.ТекущийПользователь.Организация); 		
	//СписокДО.Параметры.УстановитьЗначениеПараметра("Подразделение", ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка")); 		
	//СписокДО.Параметры.УстановитьЗначениеПараметра("Сотрудник", ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка")); 
	Если Параметры.Свойство("ЗаполнениеСудебныхУчастковДолжников") Тогда 
		Объект.ВидПодбораОбъектов = ПредопределенноеЗначение("Перечисление.ВидыПодбораОбъектов.ТолькоОбъектыВРаботе");
		Объект.ВидСправочника = ПредопределенноеЗначение("Перечисление.ВидыСправочникаДляПодбора.ДолговыеОбязательства");	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьЗначенияПараметров();
	//Элементы.ВидПодбораОбъектов.Видимость = ПараметрыСеанса.ТекущийПользователь.ЭтоРуководитель;
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЗапрос()
	СписокДО.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
	СписокДО.ТекстЗапроса = УправлениеСвойствами.ПолучитьТекстЗапроса1(Объект.ВидПодбораОбъектов, Объект.ВидСправочника);
КонецПроцедуры

&НаКлиенте
Процедура ВидПодбораОбъектовПриИзменении(Элемент)
	ПерезаполнитьЗапрос();
КонецПроцедуры

&НаКлиенте
Процедура ВидСправочникаПриИзменении(Элемент)
	ПерезаполнитьЗапрос();
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьВыделение(Команда)
	Список.Очистить();
	Для Каждого Стр Из Элементы.СписокДО.ВыделенныеСтроки Цикл
		Список.Добавить(Элементы.СписокДО.ДанныеСтроки(стр).Объект);
	КонецЦикла;
	
	ОтобратьПоДинамическомуСпискуСУчетомВыделения();
	УстановитьФлажки(Неопределено);
КонецПроцедуры
